{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_8", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 299, 299, 3], "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "block1_conv1", "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block1_conv1_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block1_conv1_bn", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block1_conv1_act"}, "name": "block1_conv1_act", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "use_bias": false, "padding": "valid", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "block1_conv2", "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block1_conv2_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block1_conv2_bn", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block1_conv2_act"}, "name": "block1_conv2_act", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_sepconv1", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 128}, "name": "block2_sepconv1", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block2_sepconv1_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block2_sepconv1_bn", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block2_sepconv2_act"}, "name": "block2_sepconv2_act", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_sepconv2", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 128}, "name": "block2_sepconv2", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block2_sepconv2_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block2_sepconv2_bn", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "use_bias": false, "padding": "same", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "activation": "linear", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_1", "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128}, "name": "conv2d_1", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "block2_pool"}, "name": "block2_pool", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_1", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block3_sepconv1_act"}, "name": "block3_sepconv1_act", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_sepconv1", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 256}, "name": "block3_sepconv1", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block3_sepconv1_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block3_sepconv1_bn", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block3_sepconv2_act"}, "name": "block3_sepconv2_act", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_sepconv2", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 256}, "name": "block3_sepconv2", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block3_sepconv2_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block3_sepconv2_bn", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "use_bias": false, "padding": "same", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "activation": "linear", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_2", "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256}, "name": "conv2d_2", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "block3_pool"}, "name": "block3_pool", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_2", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block4_sepconv1_act"}, "name": "block4_sepconv1_act", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_sepconv1", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block4_sepconv1", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block4_sepconv1_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block4_sepconv1_bn", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block4_sepconv2_act"}, "name": "block4_sepconv2_act", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_sepconv2", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block4_sepconv2", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block4_sepconv2_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block4_sepconv2_bn", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "use_bias": false, "padding": "same", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "activation": "linear", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_3", "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728}, "name": "conv2d_3", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "block4_pool"}, "name": "block4_pool", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_3", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block5_sepconv1_act"}, "name": "block5_sepconv1_act", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_sepconv1", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block5_sepconv1", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block5_sepconv1_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block5_sepconv1_bn", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block5_sepconv2_act"}, "name": "block5_sepconv2_act", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_sepconv2", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block5_sepconv2", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block5_sepconv2_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block5_sepconv2_bn", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block5_sepconv3_act"}, "name": "block5_sepconv3_act", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_sepconv3", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block5_sepconv3", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block5_sepconv3_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block5_sepconv3_bn", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block6_sepconv1_act"}, "name": "block6_sepconv1_act", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block6_sepconv1", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block6_sepconv1", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block6_sepconv1_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block6_sepconv1_bn", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block6_sepconv2_act"}, "name": "block6_sepconv2_act", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block6_sepconv2", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block6_sepconv2", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block6_sepconv2_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block6_sepconv2_bn", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block6_sepconv3_act"}, "name": "block6_sepconv3_act", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block6_sepconv3", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block6_sepconv3", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block6_sepconv3_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block6_sepconv3_bn", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "name": "add_5", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block7_sepconv1_act"}, "name": "block7_sepconv1_act", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block7_sepconv1", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block7_sepconv1", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block7_sepconv1_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block7_sepconv1_bn", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block7_sepconv2_act"}, "name": "block7_sepconv2_act", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block7_sepconv2", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block7_sepconv2", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block7_sepconv2_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block7_sepconv2_bn", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block7_sepconv3_act"}, "name": "block7_sepconv3_act", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block7_sepconv3", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block7_sepconv3", "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block7_sepconv3_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block7_sepconv3_bn", "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "name": "add_6", "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block8_sepconv1_act"}, "name": "block8_sepconv1_act", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block8_sepconv1", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block8_sepconv1", "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block8_sepconv1_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block8_sepconv1_bn", "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block8_sepconv2_act"}, "name": "block8_sepconv2_act", "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block8_sepconv2", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block8_sepconv2", "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block8_sepconv2_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block8_sepconv2_bn", "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block8_sepconv3_act"}, "name": "block8_sepconv3_act", "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block8_sepconv3", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block8_sepconv3", "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block8_sepconv3_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block8_sepconv3_bn", "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "name": "add_7", "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block9_sepconv1_act"}, "name": "block9_sepconv1_act", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block9_sepconv1", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block9_sepconv1", "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block9_sepconv1_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block9_sepconv1_bn", "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block9_sepconv2_act"}, "name": "block9_sepconv2_act", "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block9_sepconv2", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block9_sepconv2", "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block9_sepconv2_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block9_sepconv2_bn", "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block9_sepconv3_act"}, "name": "block9_sepconv3_act", "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block9_sepconv3", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block9_sepconv3", "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block9_sepconv3_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block9_sepconv3_bn", "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "name": "add_8", "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block10_sepconv1_act"}, "name": "block10_sepconv1_act", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block10_sepconv1", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block10_sepconv1", "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block10_sepconv1_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block10_sepconv1_bn", "inbound_nodes": [[["block10_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block10_sepconv2_act"}, "name": "block10_sepconv2_act", "inbound_nodes": [[["block10_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block10_sepconv2", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, "dilation_rate": [1, 1], "depth_multiplier": 1, "strides": [1, 1], "use_bias": false, "filters": 728}, "name": "block10_sepconv2", "inbound_nodes": [[["block10_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "beta_constraint": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "name": "block10_sepconv2_bn", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}, "name": "block10_sepconv2_bn", "inbound_nodes": [[["block10_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block10_sepconv3_act"}, "name": "block10_sepconv3_act", "inbound_nodes": [[["block10_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"pointwise_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block10_sepconv3", "bias_regularizer": null, "activation": "linear", "depthwise_constraint": null, "depthwise_regularizer": null, "pointwise_constraint": null, 